Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: :cpp:enumerator:`LV_KEY_ESC`: Close or exit (e.g., close a :ref:`Drop-Down List <lv_dropdown>`)
it_it: :cpp:enumerator:`LV_KEY_ESC`: Chiude o esce (ad esempio, chiude una :ref:`Lista Drop-Down <lv_dropdown>`)

source: :cpp:enumerator:`LV_KEY_HOME`: Go to the beginning/top (e.g., in a :ref:`Text Area <lv_textarea>`)
it_it: :cpp:enumerator:`LV_KEY_HOME`: Va all'inizio/top (ad esempio, in una :ref:`Text Area <lv_textarea>`)

source: :cpp:enumerator:`LV_KEY_LEFT`: Decrease value or move to the left
it_it: :cpp:enumerator:`LV_KEY_LEFT`: Diminuisce il valore o sposta verso sinistra

source: :cpp:enumerator:`LV_KEY_LEFT`: simulates turning the encoder left.
it_it: :cpp:enumerator:`LV_KEY_LEFT`: simula la rotazione dell'encoder verso sinistra.

source: :cpp:enumerator:`LV_KEY_NEXT`: Move focus to the next object
it_it: :cpp:enumerator:`LV_KEY_NEXT`: Sposta il focus sull'oggetto successivo

source: :cpp:enumerator:`LV_KEY_PREV`: Move focus to the previous object
it_it: :cpp:enumerator:`LV_KEY_PREV`: Sposta il focus sull'oggetto precedente

source: :cpp:enumerator:`LV_KEY_RIGHT`: Increase value or move to the right
it_it: :cpp:enumerator:`LV_KEY_RIGHT`: Aumenta il valore o sposta verso destra

source: :cpp:enumerator:`LV_KEY_RIGHT`: simulates turning the encoder right.
it_it: :cpp:enumerator:`LV_KEY_RIGHT`: simula la rotazione dell'encoder verso destra.

source: :cpp:enumerator:`LV_KEY_UP`: Increase value or move up
it_it: :cpp:enumerator:`LV_KEY_UP`: Aumenta il valore o sposta verso l'alto

source: :cpp:enumerator:`LV_LABEL_LONG_MODE_CLIP` Simply clip the parts of the text outside the Label.
it_it: :cpp:enumerator:`LV_LABEL_LONG_MODE_CLIP` Ritaglia semplicemente le parti di testo esterne all'etichetta.

source: :cpp:enumerator:`LV_LABEL_LONG_MODE_DOTS` Replaces the last 3 characters from bottom right corner of the Label with dots (``.``)
it_it: :cpp:enumerator:`LV_LABEL_LONG_MODE_DOTS` Sostituisce gli ultimi 3 caratteri dall'angolo in basso a destra dell'etichetta con punti (``.``)

source: :cpp:enumerator:`LV_LABEL_LONG_MODE_SCROLL_CIRCULAR` If the text is wider than the Label, scroll it horizontally continuously.
it_it: :cpp:enumerator:`LV_LABEL_LONG_MODE_SCROLL_CIRCULAR` Se il testo è più largo dell'etichetta, scorrerlo orizzontalmente in modo continuo.

source: :cpp:enumerator:`LV_LABEL_LONG_MODE_SCROLL` If the text is wider than the label, scroll it horizontally back and forth.
it_it: :cpp:enumerator:`LV_LABEL_LONG_MODE_SCROLL` Se il testo è più largo dell'etichetta, scorrerlo orizzontalmente avanti e indietro.

source: :cpp:enumerator:`LV_LABEL_LONG_MODE_WRAP` Wrap lines that are too long.
it_it: :cpp:enumerator:`LV_LABEL_LONG_MODE_WRAP` Manda a capo le righe troppo lunghe.

source: :cpp:enumerator:`LV_LAYER_SIMPLE_BUF_SIZE`: [bytes] the optimal target buffer size.
it_it: :cpp:enumerator:`LV_LAYER_SIMPLE_BUF_SIZE`: [bytes] la dimensione ottimale del buffer target.

source: :cpp:enumerator:`LV_LAYER_SIMPLE_FALLBACK_BUF_SIZE`: [bytes] used if :cpp:enumerator:`LV_LAYER_SIMPLE_BUF_SIZE` couldn't be allocated.
it_it: :cpp:enumerator:`LV_LAYER_SIMPLE_FALLBACK_BUF_SIZE`: [bytes] utilizzati se :cpp:enumerator:`LV_LAYER_SIMPLE_BUF_SIZE` non è stato possibile allocare.

source: :cpp:enumerator:`LV_LED_PART_MAIN` uses the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_LED_PART_MAIN` utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_MENU_HEADER_BOTTOM_FIXED` Header is positioned at the bottom.
it_it: :cpp:enumerator:`LV_MENU_HEADER_BOTTOM_FIXED` L'intestazione è posizionata in basso.

source: :cpp:enumerator:`LV_MENU_HEADER_TOP_FIXED` Header is positioned at the top.
it_it: :cpp:enumerator:`LV_MENU_HEADER_TOP_FIXED` L'intestazione è posizionata in alto.

source: :cpp:enumerator:`LV_MENU_HEADER_TOP_UNFIXED` Header is positioned at the top and can be scrolled out of view.
it_it: :cpp:enumerator:`LV_MENU_HEADER_TOP_UNFIXED` L'intestazione è posizionata in alto e può essere fatta scorrere fuori dalla vista.

source: :cpp:enumerator:`LV_MENU_ROOT_BACK_BTN_DISABLED` (default)
it_it: :cpp:enumerator:`LV_MENU_ROOT_BACK_BTN_DISABLED` (il default)

source: :cpp:enumerator:`LV_OBJ_FLAG_ADV_HITTEST`: Enable more accurate hit (click) testing (e.g., account for rounded corners).
it_it: :cpp:enumerator:`LV_OBJ_FLAG_ADV_HITTEST`: Abilita un test di hit (clic) più accurato (ad esempio, tenendo conto degli angoli arrotondati).

source: :cpp:enumerator:`LV_OBJ_FLAG_CHECKABLE`: Toggle the checked state when the widget is clicked.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_CHECKABLE`: Attiva/disattiva lo stato di "checked" quando si clicca sul widget.

source: :cpp:enumerator:`LV_OBJ_FLAG_CLICKABLE`: Make the widget clickable by input devices.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_CLICKABLE` Rende il widget cliccabile dai dispositivi di input.

source: :cpp:enumerator:`LV_OBJ_FLAG_CLICK_FOCUSABLE`: Add the focused state to the widget when clicked.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_CLICK_FOCUSABLE`: Aggiunge lo stato di focus al widget quando viene cliccato.

source: :cpp:enumerator:`LV_OBJ_FLAG_EVENT_BUBBLE` is enabled on the buttons so you can add events to the Menu itself.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_EVENT_BUBBLE` è abilitato sui pulsanti, in modo da poter aggiungere eventi al Menu stesso.

source: :cpp:enumerator:`LV_OBJ_FLAG_EVENT_BUBBLE`: Propagate events to the parent.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_EVENT_BUBBLE`: Propaga gli eventi all'elemento padre.

source: :cpp:enumerator:`LV_OBJ_FLAG_EVENT_TRICKLE`: Propagate events to children.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_EVENT_TRICKLE`: Propaga gli eventi ai figli.

source: :cpp:enumerator:`LV_OBJ_FLAG_FLEX_IN_NEW_TRACK`: Start a new flex track on this item.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_FLEX_IN_NEW_TRACK`: Comincia una nuova "track" flex su questo elemento.

source: :cpp:enumerator:`LV_OBJ_FLAG_FLOATING` Same as :cpp:enumerator:`LV_OBJ_FLAG_IGNORE_LAYOUT` but the Widget with :cpp:enumerator:`LV_OBJ_FLAG_FLOATING` will be ignored in :c:macro:`LV_SIZE_CONTENT` calculations.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_FLOATING` Uguale a :cpp:enumerator:`LV_OBJ_FLAG_IGNORE_LAYOUT` ma il Widget con :cpp:enumerator:`LV_OBJ_FLAG_FLOATING` verrà ignorato nei calcoli di :c:macro:`LV_SIZE_CONTENT`.

source: :cpp:enumerator:`LV_OBJ_FLAG_FLOATING`: Do not scroll with the parent and ignore layout.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_FLOATING`: Non scorre con l'elemento padre e ignora il layout.

source: :cpp:enumerator:`LV_OBJ_FLAG_GESTURE_BUBBLE`: Propagate gestures to the parent.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_GESTURE_BUBBLE`: Propaga i gesti all'elemento padre.

source: :cpp:enumerator:`LV_OBJ_FLAG_HIDDEN` Hidden Widgets are ignored in layout calculations.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_HIDDEN` I Widget nascosti vengono ignorati nei calcoli del layout.

source: :cpp:enumerator:`LV_OBJ_FLAG_HIDDEN`: Make the widget hidden (as if it weren’t there at all).
it_it: :cpp:enumerator:`LV_OBJ_FLAG_HIDDEN`: Nasconde il widget (come se non ci fosse).

source: :cpp:enumerator:`LV_OBJ_FLAG_IGNORE_LAYOUT` The Widget is simply ignored by the layouts.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_IGNORE_LAYOUT` Il Widget viene semplicemente ignorato dai layout.

source: :cpp:enumerator:`LV_OBJ_FLAG_IGNORE_LAYOUT`: Exclude the widget from layout positioning.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_IGNORE_LAYOUT`: Esclude il widget dal posizionamento del layout.

source: :cpp:enumerator:`LV_OBJ_FLAG_LAYOUT_1`: Custom flag, free to use by layouts.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_LAYOUT_1`: Flag custom, utilizzabile liberamente dai layout.

source: :cpp:enumerator:`LV_OBJ_FLAG_LAYOUT_2`: Custom flag, free to use by layouts.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_LAYOUT_2`: Flag custom, utilizzabile liberamente dai layout.

source: :cpp:enumerator:`LV_OBJ_FLAG_OVERFLOW_VISIBLE`: Allow children to overflow outside the widget's bounds.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_OVERFLOW_VISIBLE`: Consenti ai figli di superare i limiti del widget.

source: :cpp:enumerator:`LV_OBJ_FLAG_PRESS_LOCK`: Keep the widget in the pressed state even if the pointer moves outside it.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_PRESS_LOCK`: Mantiene il widget nello stato "pressed" anche se il puntatore si sposta al di fuori di esso.

source: :cpp:enumerator:`LV_OBJ_FLAG_RADIO_BUTTON`: Allow only one ``RADIO_BUTTON`` sibling to be checked.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_RADIO_BUTTON`: Consente di controllare solo un ``RADIO_BUTTON``.

source: :cpp:enumerator:`LV_OBJ_FLAG_SCROLLABLE`: Make the widget scrollable.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SCROLLABLE`: Rende il widget "scrollable".

source: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_CHAIN_HOR`: Propagate horizontal scrolling to the parent.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_CHAIN_HOR`: Propaga lo scorrimento orizzontale all'elemento padre.

source: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_CHAIN_VER`: Propagate vertical scrolling to the parent.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_CHAIN_VER`: Propaga lo scorrimento verticale all'elemento padre.

source: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_CHAIN`: Shorthand for `SCROLL_CHAIN_HOR | SCROLL_CHAIN_VER`.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_CHAIN`: Abbreviazione di `SCROLL_CHAIN_HOR | SCROLL_CHAIN_VER`.

source: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_ELASTIC`: Allow elastic scrolling with slower movement.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_ELASTIC`: Consente lo scorrimento elastico con movimento più lento.

source: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_MOMENTUM`: Enable momentum scrolling (continue scrolling when “thrown”).
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_MOMENTUM`: Abilita lo scorrimento "momentum" [abbrivio] (continua lo scorrimento quando “lanciato”).

source: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_ONE`: Allow scrolling only one snappable child.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_ONE`: Consente lo scrolling di un solo elemento figlio "snappable" [agganciabile].

source: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_ON_FOCUS`: Automatically scroll to make the widget visible when focused.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_ON_FOCUS`: Scorre automaticamente per rendere visibile il widget quando è attivo.

source: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_WITH_ARROW`: Allow scrolling the focused widget with arrow keys.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_WITH_ARROW`: Consente lo scrolling del widget attivo con i tasti freccia.

source: :cpp:enumerator:`LV_OBJ_FLAG_SEND_DRAW_TASK_EVENTS`: Enable sending ``LV_EVENT_DRAW_TASK_ADDED`` events.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SEND_DRAW_TASK_EVENTS`: Abilita l'invio di eventi ``LV_EVENT_DRAW_TASK_ADDED``.

source: :cpp:enumerator:`LV_OBJ_FLAG_SNAPPABLE`: Allow the widget to be snapped if the parent has scroll snapping enabled.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_SNAPPABLE`: Consente lo "snap" [aggancio] del widget se l'elemento padre ha abilitato l'aggancio con scorrimento.

source: :cpp:enumerator:`LV_OBJ_FLAG_STATE_TRICKLE`: Propagate state changes to children.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_STATE_TRICKLE`: Propaga le modifiche di stato agli elementi figlio.

source: :cpp:enumerator:`LV_OBJ_FLAG_USER_1`: Custom flag, free to use by the user.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_USER_1`: Flag custom, libero da usare da parte dell'utente.

source: :cpp:enumerator:`LV_OBJ_FLAG_USER_2`: Custom flag, free to use by the user.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_USER_2`: Flag custom, libero da usare da parte dell'utente.

source: :cpp:enumerator:`LV_OBJ_FLAG_WIDGET_1`: Custom flag, free to use by widgets.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_WIDGET_1`: Flag custom, utilizzabile gratuitamente dai widget.

source: :cpp:enumerator:`LV_OBJ_FLAG_WIDGET_2`: Custom flag, free to use by widgets.
it_it: :cpp:enumerator:`LV_OBJ_FLAG_WIDGET_2`: Flag custom, utilizzabile liberamente dai widget.

source: :cpp:enumerator:`LV_OPA_10` Value: 25, means the color covers only a little
it_it: :cpp:enumerator:`LV_OPA_10` Valore: 25, significa che il colore copre solo parzialmente

source: :cpp:enumerator:`LV_OPA_90` Value: 229, means the color nearly completely covers
it_it: :cpp:enumerator:`LV_OPA_90` Valore: 229, significa che il colore copre quasi completamente

source: :cpp:enumerator:`LV_OPA_COVER` Value: 255, means the color completely covers (full opacity)
it_it: :cpp:enumerator:`LV_OPA_COVER` Valore: 255, significa che il colore copre completamente (opacità completa)

source: :cpp:enumerator:`LV_OPA_TRANSP` Value: 0, means no opacity making the color completely transparent
it_it: :cpp:enumerator:`LV_OPA_TRANSP` Valore: 0, significa nessuna opacità, rendendo il colore completamente trasparente

source: :cpp:enumerator:`LV_PART_ANY`: (0x0F0000) Special value can be used in some functions to target all parts.
it_it: :cpp:enumerator:`LV_PART_ANY`: (0x0F0000) In alcune funzioni è possibile utilizzare un valore speciale per indirizzare tutte le parti.

source: :cpp:enumerator:`LV_PART_CURSOR` *Line* properties are used to style cursors.
it_it: :cpp:enumerator:`LV_PART_CURSOR` Le proprietà *Line* vengono utilizzate per definire lo stile dei cursori.

source: :cpp:enumerator:`LV_PART_CURSOR` Marks the position where the characters are inserted.
it_it: :cpp:enumerator:`LV_PART_CURSOR` Indica la posizione in cui vengono inseriti i caratteri.

source: :cpp:enumerator:`LV_PART_CURSOR`: (0x060000) Mark a specific place e.g. Text Area's or chart's cursor
it_it: :cpp:enumerator:`LV_PART_CURSOR`: (0x060000) Contrassegna un punto specifico, ad esempio il cursore dell'area di testo o del grafico

source: :cpp:enumerator:`LV_PART_CURSOR`: Marks a specific position, e.g., the cursor in a text area or chart.
it_it: :cpp:enumerator:`LV_PART_CURSOR`: Indica una posizione specifica, ad esempio il cursore in un'area di testo o in un grafico.

source: :cpp:enumerator:`LV_PART_CUSTOM_FIRST`: (0x080000) Custom part identifiers can be added starting from here.
it_it: :cpp:enumerator:`LV_PART_CUSTOM_FIRST`: (0x080000) Da qui è possibile aggiungere identificatori di parti personalizzati.

source: :cpp:enumerator:`LV_PART_CUSTOM_FIRST`: Custom parts can be added starting from here.
it_it: :cpp:enumerator:`LV_PART_CUSTOM_FIRST`: È possibile aggiungere parti personalizzate a partire da qui.

source: :cpp:enumerator:`LV_PART_INDICATOR` Draws another Arc using the *Arc* style properties.
it_it: :cpp:enumerator:`LV_PART_INDICATOR` Disegna un altro arco utilizzando le proprietà di stile *Arc*.

source: :cpp:enumerator:`LV_PART_INDICATOR` Major ticks and their labels (if enabled) --- the green major ticks and pink labels in example image.
it_it: :cpp:enumerator:`LV_PART_INDICATOR` Tacche principali e relative etichette (se abilitate) --- le tacche principali verdi e le etichette rosa nell'immagine di esempio.

source: :cpp:enumerator:`LV_PART_INDICATOR` Refers to points on LINE- and SCATTER-charts (small circles or squares [with possibly-rounded corners]).
it_it: :cpp:enumerator:`LV_PART_INDICATOR` Si riferisce ai punti sui grafici a LINEE e SCATTER (piccoli cerchi o quadrati [con angoli eventualmente arrotondati]).

source: :cpp:enumerator:`LV_PART_INDICATOR` The "tick box" is a square that uses the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_PART_INDICATOR` La "tick box" è un quadrato che utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_PART_INDICATOR` The Bar's indicator; also uses the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_PART_INDICATOR` L'indicatore della Bar; utilizza anch'esso le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_PART_INDICATOR` The indicator that shows the current state of the Slider; also uses the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_PART_INDICATOR` L'indicatore che mostra lo stato corrente dello Slider; utilizza anch'esso le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_PART_INDICATOR` The indicator that shows the current state of the Switch; also uses the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_PART_INDICATOR` L'indicatore che mostra lo stato corrente dello Switch; utilizza anch'esso le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_PART_INDICATOR` Typically an arrow symbol that can be an Image or text (e.g. :cpp:enumerator:`LV_SYMBOL`).
it_it: :cpp:enumerator:`LV_PART_INDICATOR` In genere un simbolo a forma di freccia che può essere un'immagine o un testo (ad esempio :cpp:enumerator:`LV_SYMBOL`).

source: :cpp:enumerator:`LV_PART_INDICATOR`: (0x020000) Indicator, e.g. for slider, bar, switch, or the tick box of the checkbox
it_it: :cpp:enumerator:`LV_PART_INDICATOR`: (0x020000) Indicatore, ad esempio per cursore, barra, interruttore o checkbox

source: :cpp:enumerator:`LV_PART_INDICATOR`: The indicator, e.g., for sliders, bars, switches, or the tick box of a checkbox.
it_it: :cpp:enumerator:`LV_PART_INDICATOR`: L'indicatore, ad esempio per cursori, barre, interruttori o la casella di spunta di una checkbox.

source: :cpp:enumerator:`LV_PART_ITEMS` Minor ticks --- the red minor ticks in example image.
it_it: :cpp:enumerator:`LV_PART_ITEMS` Tacche secondarie --- le tacche secondarie rosse nell'immagine di esempio.

source: :cpp:enumerator:`LV_PART_ITEMS` Refers to dates and day names.
it_it: :cpp:enumerator:`LV_PART_ITEMS` Si riferisce a date e nomi dei giorni.

source: :cpp:enumerator:`LV_PART_ITEMS` Refers to the LINE or BAR data series.
it_it: :cpp:enumerator:`LV_PART_ITEMS` Si riferisce alle serie di dati LINE o BAR.

source: :cpp:enumerator:`LV_PART_ITEMS` The buttons all use the text and typical background style properties except translations and transformations.
it_it: :cpp:enumerator:`LV_PART_ITEMS` Tutti i pulsanti utilizzano le tipiche proprietà di stile del testo e dello sfondo, ad eccezione di traslazioni e trasformazioni.

source: :cpp:enumerator:`LV_PART_ITEMS` The buttons.
it_it: :cpp:enumerator:`LV_PART_ITEMS` I pulsanti.

source: :cpp:enumerator:`LV_PART_ITEMS` The cells of the Table also use the :ref:`typical background style properties <typical bg props>` as well as text style properties.
it_it: :cpp:enumerator:`LV_PART_ITEMS` Anche le celle della tabella utilizzano le :ref:`tipiche proprietà di stile del background <typical bg props>` e le proprietà di stile del testo.

source: :cpp:enumerator:`LV_PART_ITEMS`: (0x050000) Used if the widget has multiple similar elements (e.g. table cells)
it_it: :cpp:enumerator:`LV_PART_ITEMS`: (0x050000) Utilizzato se il widget ha più elementi simili (ad esempio, celle di tabella)

source: :cpp:enumerator:`LV_PART_ITEMS`: Used if the widget has multiple similar elements (e.g., table cells).
it_it: :cpp:enumerator:`LV_PART_ITEMS`: Utilizzato se il widget ha più elementi simili (ad esempio, celle di tabella).

source: :cpp:enumerator:`LV_PART_KNOB` A rectangle (or circle) drawn at the current value; also uses the :ref:`typical background style properties <typical bg props>` to describe the knob(s).
it_it: :cpp:enumerator:`LV_PART_KNOB` Un rettangolo (o cerchio) disegnato in corrispondenza del valore corrente; utilizza anch'esso le :ref:`tipiche proprietà di stile del background <typical bg props>` per descrivere le manopole.

source: :cpp:enumerator:`LV_PART_KNOB` A rectangle (or circle) drawn at the left or right side of the indicator; also uses the :ref:`typical background style properties <typical bg props>` to modify the knob's appearance.
it_it: :cpp:enumerator:`LV_PART_KNOB` Un rettangolo (o cerchio) disegnato a sinistra o a destra dell'indicatore; utilizza anch'esso le :ref:`tipiche proprietà di stile del background <typical bg props>` per modificare l'aspetto della manopola.

source: :cpp:enumerator:`LV_PART_KNOB` Draws a handle on the end of the indicator using all background properties and padding values.
it_it: :cpp:enumerator:`LV_PART_KNOB` Disegna una maniglia all'estremità dell'indicatore utilizzando tutte le proprietà di sfondo e i valori di padding.

source: :cpp:enumerator:`LV_PART_KNOB`: (0x030000) Like a handle to grab to adjust a value
it_it: :cpp:enumerator:`LV_PART_KNOB`: (0x030000) Come una maniglia da afferrare per regolare un valore

source: :cpp:enumerator:`LV_PART_KNOB`: A handle used to adjust a value.
it_it: :cpp:enumerator:`LV_PART_KNOB`: Una maniglia utilizzata per regolare un valore.

source: :cpp:enumerator:`LV_PART_MAIN` A background rectangle that uses the :ref:`typical background style properties <typical bg props>` and the image itself using the image style properties.
it_it: :cpp:enumerator:`LV_PART_MAIN` Un rettangolo di background che utilizza :ref:`tipiche proprietà di stile del background <typical bg props>` e l'immagine stessa che utilizza le proprietà di stile dell'immagine.

source: :cpp:enumerator:`LV_PART_MAIN` A background rectangle that uses the :ref:`typical background style properties <typical bg props>`, and the image itself uses the image style properties.
it_it: :cpp:enumerator:`LV_PART_MAIN` Un rettangolo di background che utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>` e l'immagine stessa utilizza le proprietà di stile dell'immagine.

source: :cpp:enumerator:`LV_PART_MAIN` Background of Checkbox and it uses the text and the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_PART_MAIN` Sfondo della Checkbox e utilizza il testo e le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_PART_MAIN` Background of button, uses the :ref:`typical background <typical bg props>` and text style properties for its text.
it_it: :cpp:enumerator:`LV_PART_MAIN` Background del pulsante, usa le proprietà di stile :ref:`tipiche del background <typical bg props>` e di text per il testo.

source: :cpp:enumerator:`LV_PART_MAIN` Calendar background.
it_it: :cpp:enumerator:`LV_PART_MAIN` Sfondo del Calendar.

source: :cpp:enumerator:`LV_PART_MAIN` Draws a background using the typical background style properties and an arc using the Arc style properties.
it_it: :cpp:enumerator:`LV_PART_MAIN` Disegna uno sfondo utilizzando le tipiche proprietà di stile del background e un arco utilizzando le proprietà di stile dell'Arc.

source: :cpp:enumerator:`LV_PART_MAIN` Main line --- the blue line in example image.
it_it: :cpp:enumerator:`LV_PART_MAIN` Linea principale --- la linea blu nell'immagine di esempio.

source: :cpp:enumerator:`LV_PART_MAIN` Refers to the image(s).
it_it: :cpp:enumerator:`LV_PART_MAIN` Si riferisce alle immagini.

source: :cpp:enumerator:`LV_PART_MAIN` Represents the main part of the Arc Label, including the arc path and the text rendered along it.
it_it: :cpp:enumerator:`LV_PART_MAIN` Rappresenta la parte principale dell'Arc Label, incluso il percorso dell'arco e il testo visualizzato lungo di esso.

source: :cpp:enumerator:`LV_PART_MAIN` Spangroup has only one part.
it_it: :cpp:enumerator:`LV_PART_MAIN` Lo Spangroup ha una sola parte.

source: :cpp:enumerator:`LV_PART_MAIN` Switch's background; uses the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_PART_MAIN` Background dello Switch; utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_PART_MAIN` The Bar's background.
it_it: :cpp:enumerator:`LV_PART_MAIN` Lo sfondo della Bar.
